import  stremlit as st
#ส่วนที่ 1 หัวข้อหน้าเว็บ (Title สีแดง)
st.markdown ("# :red[🏃แอบพลิเคชั่นคำนวนค่าดัชนีมวลกาย BMI]")
st.write("กรอกข้อมูลและน้ำหนักส่วนสูงของคุณ เพื่อเช็คสุขภาพเบื้องต้น")

#ส่วนที่ 2 ส้รางช่องรับค่าน้ำหนัก และ ส่วนสูง
weight = st.number_input("กรองน้ำหนักของคุณ (กิโลกรัม):")
height_cm = st.number_input("กรอกส่วนสูงของคุณ (เซนติเมตร):")

#ส่วนที่ 3 สร้างปุ่มกดคำนวน
if st.botton("คำนวนค่า BMI ❤️"):
  # แปลงส่วนสูงจาก cm เป้น เมตร แล้วคำนวน BMI
  height_m = height_cm / 100
  bmi = weight / (height_m ** 2)

  st.write("_ _ _")
  st.header(f"ค่า BMI ของคุณคือ: **{bmi :.2f}**")
